app/controllers/books_controller.rb

INSERT INTO "books" ("title", "number_of_pages", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "thúy hư"], ["number_of_pages", 2], ["created_at", "2023-01-08 17:00:37.202180"], ["updated_at", "2023-01-08 17:00:37.202180"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save